#ifndef __TM_PANEL__
#define __TM_PANEL__

#define MAX_NUMBER_F_IN_PANEL           10

#define TM_UKR_TXT                     "Телемеханіка"
#define TM_RUS_TXT                     "Телемеханика"
#define TM_ENG_TXT                     "Telemechanics"

#define EXPL_TM_IT_UKR                 "Відображення інф.по телемеханіці"
#define EXPL_TM_IT_RUS                 "Отображение инф. о телемеханике"
#define EXPL_TM_IT_ENG                 "Show Telemechanics info"

#define TITLE_TM_PANEL_UKR             "Телемеханіка"
#define TITLE_TM_PANEL_RUS             "Телемеханика"
#define TITLE_TM_PANEL_ENG             "Telemechanics"

#define TITLE_TM_PAGE_1_UKR             "Вх./Вих."
#define EXPL_TM_PAGE_1_UKR              "Стан входів і виходів"
#define TITLE_TM_PAGE_1_RUS             "Вх./Вых."
#define EXPL_TM_PAGE_1_RUS              "Состояние входов и выходов"
#define TITLE_TM_PAGE_1_ENG             "I/O"
#define EXPL_TM_PAGE_1_ENG              "Inputs & Outputs state"

#define TITLE_TM_PAGE_2_UKR             "Функції"
#define EXPL_TM_PAGE_2_UKR              "Стан захистів і авт."
#define TITLE_TM_PAGE_2_RUS             "Функции"
#define EXPL_TM_PAGE_2_RUS              "Состояние защит и авт."
#define TITLE_TM_PAGE_2_ENG             "Functions"
#define EXPL_TM_PAGE_2_ENG              "Protection & Aut.state"

#define TITLE_TM_IO_COLUMN_1_UKR        "Д.Входи"
#define TITLE_TM_IO_COLUMN_1_RUS        "Д.Входы"
#define TITLE_TM_IO_COLUMN_1_ENG        "D.Input"

#define TITLE_TM_IO_COLUMN_2_UKR        "Д.Виходи"
#define TITLE_TM_IO_COLUMN_2_RUS        "Д.Выходы"
#define TITLE_TM_IO_COLUMN_2_ENG        "D.Output"

#define TITLE_TM_F_COLUMN_1_UKR        "Активні фунції"
#define TITLE_TM_F_COLUMN_1_RUS        "Активные функции"
#define TITLE_TM_F_COLUMN_1_ENG        "Active functions"

#define NAME_FUNCTION_LIST_UKR {\
  "RESERV_000_OEPRF_ONB",\
  "RESERV_001_OEPRF_ONB",\
  "Вкл. ВВ от ДВ",\
  "Откл. ВВ",\
  "Контроль Вкл",\
  "Контроль Откл",\
  "Сброс Реле",\
  "Сброс индикаци",\
  "Блокировка включения ВВ",\
  "Положение ВВ (выключателя)",\
  "Разблокировка включения ВВ",\
  "Блокировка Дист З1",\
  "Блокировка Дист З2",\
  "Оперативное ускорение Дист З2",\
  "Телеускорение ускорение Дист З2",\
  "Блокировка Опер ускор Дист З2",\
  "Блокировка Дист З3",\
  "Оперативное ускорение Дист З3",\
  "Телеускорение ускорение Дист З3",\
  "Блокировка Опер ускор Дист З3",\
  "Блокировка Дист З4",\
  "Оперативное ускорение Дист З4",\
  "Телеускорение ускорение Дист З4",\
  "Блокировка Опер ускор Дист З4",\
  "Блокировка Дист З5",\
  "Оперативное ускорение Дист З5",\
  "Телеускорение ускорение Дист З5",\
  "Блокировка Опер ускор Дист З5",\
  "2группа уставок ДистЗ",\
  "Блокировка МТЗ1",\
  "Блокировка МТЗ2",\
  "Блокировка МТЗ3",\
  "Блокировка МТЗ4",\
  "Блокировка МТЗ5",\
  "Телеускорение   МТЗ2",\
  "Оперативное ускорение МТЗ2",\
  "Блокировка Опер ускор МТЗ2",\
  "Телеускорение   МТЗ3",\
  "Оперативное ускорение МТЗ3",\
  "Блокировка Опер ускор МТЗ3",\
  "Телеускорение   МТЗ4",\
  "Оперативное ускорение МТЗ4",\
  "Блокировка Опер ускор МТЗ4",\
  "Телеускорение   МТЗ5",\
  "Оперативное ускорение МТЗ5",\
  "Блокировка Опер ускор МТЗ5",\
  "2группа уставок МТЗ",\
  "Пуск АПВ от ДВ",\
  "Блокировка АПВ ОТ ДВ",\
  "Блокировка Umin1",\
  "Пуск Umin1",\
  "Блокировка Umin2",\
  "Пуск Umin2",\
  "Блокировка ТЗНП1",\
  "Оперативное ускорение ТЗНП1",\
  "Блокировка Опер ускор ТЗНП1",\
  "Блокировка ТЗНП2",\
  "Оперативное ускорение ТЗНП2",\
  "Блокировка Опер ускор ТЗНП2",\
  "Блокировка ТЗНП3",\
  "Оперативное ускорение ТЗНП3",\
  "Блокировка Опер ускор ТЗНП3",\
  "Блокировка ТЗНП4",\
  "Оперативное ускорение ТЗНП4",\
  "Блокировка Опер ускор ТЗНП4",\
  "Блокировка ТЗНП5",\
  "Оперативное ускорение ТЗНП5",\
  "Блокировка Опер ускор ТЗНП5",\
  "Телеускорение   ТЗНП1",\
  "Телеускорение   ТЗНП2",\
  "Телеускорение   ТЗНП3",\
  "Телеускорение   ТЗНП4",\
  "Телеускорение   ТЗНП5",\
  "Блокировка ЗОП1",\
  "Блокировка ЗОП2",\
  "2группа уставок ЗОП",\
  "Пуск УРОВ",\
  "BLOCK_UMAX1_DI_OEPRF_ONB",\
  "BLOCK_UMAX2_DI_OEPRF_ONB",\
  "Привод ВВ",\
  "Неисправность цепйй напр ДистЗ",\
  "Работа БО",\
  "Работа БВ",\
  "ПО ДЗ1 МФ",\
  "Cраб ДЗ1 МФ",\
  "ПО МТЗ ДЗ1",\
  "Сраб МТЗ ДЗ1",\
  "ПО ДЗ1 ОФ",\
  "сраб ДЗ1 ОФ",\
  "Cраб ДЗ2 МФ",\
  "ПО ДЗ2 МФ",\
  "Сраб МТЗ ДЗ2",\
  "ПО МТЗ ДЗ2",\
  "Сраб ДЗ2 ОФ",\
  "ПО ДЗ2 ОФ",\
  "Cраб ДЗ3 МФ",\
  "ПО ДЗ3 МФ",\
  "Сраб МТЗ ДЗ3",\
  "ПО МТЗ ДЗ3",\
  "Сраб ДЗ3 ОФ",\
  "ПО ДЗ3 ОФ",\
  "Cраб ДЗ4 МФ",\
  "ПО ДЗ4 МФ",\
  "Сраб МТЗ ДЗ4",\
  "ПО МТЗ ДЗ4",\
  "Сраб ДЗ4 ОФ",\
  "ПО ДЗ4 ОФ",\
  "Cраб ДЗ5 МФ",\
  "ПО ДЗ5 МФ",\
  "Сраб МТЗ ДЗ5",\
  "ПО МТЗ ДЗ5",\
  "Сраб ДЗ5 ОФ",\
  "ПО ДЗ5 ОФ",\
  "Сектор МТЗН1Впер",\
  "Сектор МТЗН1Назад",\
  "Сраб ПО МТЗ1",\
  "Сраб ПО МТЗН1Впер",\
  "Сраб ПО МТЗН1Назад",\
  "Сраб ПО МТЗ1ПН",\
  "Сраб МТЗ1",\
  "Сектор МТЗН2Впер",\
  "Сектор МТЗН2Назад",\
  "Сраб ПО МТЗ2",\
  "Сраб ПО МТЗН2Впер",\
  "Сраб ПО МТЗН2Назад",\
  "Сраб ПО МТЗ2ПН",\
  "Сраб МТЗ2",\
  "Сектор МТЗН3Впер",\
  "Сектор МТЗН3Назад",\
  "Сраб ПО МТЗ3",\
  "Сраб ПО МТЗН3Впер",\
  "Сраб ПО МТЗН3Назад",\
  "Сраб ПО МТЗ3ПН",\
  "Сраб МТЗ3",\
  "Сектор МТЗН4Впер",\
  "Сектор МТЗН4Назад",\
  "Сраб ПО МТЗ4",\
  "Сраб ПО МТЗН4Впер",\
  "Сраб ПО МТЗН4Назад",\
  "Сраб ПО МТЗ4ПН",\
  "Сраб МТЗ4",\
  "Сектор МТЗН5Впер",\
  "Сектор МТЗН5Назад",\
  "Сраб ПО МТЗ5",\
  "Сраб ПО МТЗН5Впер",\
  "Сраб ПО МТЗН5Назад",\
  "Сраб ПО МТЗ5ПН",\
  "Сраб МТЗ5",\
  "Сектор ТЗНП1",\
  "Сраб ПО ТЗНП1",\
  "Сраб ТЗНП1",\
  "ПО ЗНП1(3U0)",\
  "Сраб ЗНП1(3U0)",\
  "ПО ЗНП1(3I0)",\
  "Сраб ЗНП1(3I0)",\
  "Сектор ТЗНП2",\
  "Сраб ПО ТЗНП2",\
  "Сраб ТЗНП2",\
  "ПО ЗНП2(3U0)",\
  "Сраб ЗНП2(3U0)",\
  "ПО ЗНП2(3I0)",\
  "Сраб ЗНП2(3I0)",\
  "Сектор ТЗНП3",\
  "Сраб ПО ТЗНП3",\
  "Сраб ТЗНП3",\
  "ПО ЗНП3(3U0)",\
  "Сраб ЗНП3(3U0)",\
  "ПО ЗНП3(3I0)",\
  "Сраб ЗНП3(3I0)",\
  "Сектор ТЗНП4",\
  "Сраб ПО ТЗНП4",\
  "Сраб ТЗНП4",\
  "ПО ЗНП4(3U0)",\
  "Сраб ЗНП4(3U0)",\
  "ПО ЗНП4(3I0)",\
  "Сраб ЗНП4(3I0)",\
  "Сектор ТЗНП5",\
  "Сраб ПО ТЗНП5",\
  "Сраб ТЗНП5",\
  "ПО ЗНП5(3U0)",\
  "Сраб ЗНП5(3U0)",\
  "ПО ЗНП5(3I0)",\
  "Сраб ЗНП5(3I0)",\
  "Сраб ПО UMAX1",\
  "Сраб UMAX1",\
  "Сраб ПО UMAX2",\
  "Сраб UMAX2",\
  "Сраб ПО Umin1",\
  "Сраб Umin1",\
  "Сраб ПО Umin2",\
  "Сраб Umin2",\
  "Превышене номинального тока откл ВВ",\
  "Ресурс ВВ исчерпан",\
  "Критический ресурс Вв",\
  "Сектор НЗОП1Впер",\
  "Сектор НЗОП1Назад",\
  "ПО ЗОП1",\
  "ПО НЗОП1Впер",\
  "ПО НЗОП1ННазад",\
  "Сраб НЗОП1",\
  "Сектор НЗОП2Впер",\
  "Сектор НЗОП2Назад",\
  "ПО ЗОП2",\
  "ПО НЗОП2Впер",\
  "ПО НЗОП2ННазад",\
  "Сраб НЗОП2",\
  "Сраб УРОВ1",\
  "Сраб УРОВ2",\
  "АПВ1",\
  "АПВ2",\
  "Выход Оф_01",\
  "Выход Оф_02",\
  "Выход Оф_03",\
  "Выход Оф_04",\
  "Выход Оф_05",\
  "Выход Оф_06",\
  "Выход Оф_07",\
  "Выход Оф_08",\
  "Выход Оф_09",\
  "Выход Оф_10",\
  "Выход Оф_11",\
  "Выход Оф_12",\
  "Выход Оф_13",\
  "Выход Оф_14",\
  "Выход Оф_15",\
  "Выход Оф_16",\
  "Выход ОТ1",\
  "Выход ОТ2",\
  "Выход ОТ3",\
  "Выход ОТ4",\
  "Выход ОТ5",\
  "Выход ОТ6",\
  "Выход ОТ7",\
  "Выход ОТ8",\
}

#define NAME_FUNCTION_LIST_RUS {\
  "RESERV_000_OEPRF_ONB",\
  "RESERV_001_OEPRF_ONB",\
  "Вкл. ВВ от ДВ",\
  "Откл. ВВ",\
  "Контроль Вкл",\
  "Контроль Откл",\
  "Сброс Реле",\
  "Сброс индикаци",\
  "Блокировка включения ВВ",\
  "Положение ВВ (выключателя)",\
  "Разблокировка включения ВВ",\
  "Блокировка Дист З1",\
  "Блокировка Дист З2",\
  "Оперативное ускорение Дист З2",\
  "Телеускорение ускорение Дист З2",\
  "Блокировка Опер ускор Дист З2",\
  "Блокировка Дист З3",\
  "Оперативное ускорение Дист З3",\
  "Телеускорение ускорение Дист З3",\
  "Блокировка Опер ускор Дист З3",\
  "Блокировка Дист З4",\
  "Оперативное ускорение Дист З4",\
  "Телеускорение ускорение Дист З4",\
  "Блокировка Опер ускор Дист З4",\
  "Блокировка Дист З5",\
  "Оперативное ускорение Дист З5",\
  "Телеускорение ускорение Дист З5",\
  "Блокировка Опер ускор Дист З5",\
  "2группа уставок ДистЗ",\
  "Блокировка МТЗ1",\
  "Блокировка МТЗ2",\
  "Блокировка МТЗ3",\
  "Блокировка МТЗ4",\
  "Блокировка МТЗ5",\
  "Телеускорение   МТЗ2",\
  "Оперативное ускорение МТЗ2",\
  "Блокировка Опер ускор МТЗ2",\
  "Телеускорение   МТЗ3",\
  "Оперативное ускорение МТЗ3",\
  "Блокировка Опер ускор МТЗ3",\
  "Телеускорение   МТЗ4",\
  "Оперативное ускорение МТЗ4",\
  "Блокировка Опер ускор МТЗ4",\
  "Телеускорение   МТЗ5",\
  "Оперативное ускорение МТЗ5",\
  "Блокировка Опер ускор МТЗ5",\
  "2группа уставок МТЗ",\
  "Пуск АПВ от ДВ",\
  "Блокировка АПВ ОТ ДВ",\
  "Блокировка Umin1",\
  "Пуск Umin1",\
  "Блокировка Umin2",\
  "Пуск Umin2",\
  "Блокировка ТЗНП1",\
  "Оперативное ускорение ТЗНП1",\
  "Блокировка Опер ускор ТЗНП1",\
  "Блокировка ТЗНП2",\
  "Оперативное ускорение ТЗНП2",\
  "Блокировка Опер ускор ТЗНП2",\
  "Блокировка ТЗНП3",\
  "Оперативное ускорение ТЗНП3",\
  "Блокировка Опер ускор ТЗНП3",\
  "Блокировка ТЗНП4",\
  "Оперативное ускорение ТЗНП4",\
  "Блокировка Опер ускор ТЗНП4",\
  "Блокировка ТЗНП5",\
  "Оперативное ускорение ТЗНП5",\
  "Блокировка Опер ускор ТЗНП5",\
  "Телеускорение   ТЗНП1",\
  "Телеускорение   ТЗНП2",\
  "Телеускорение   ТЗНП3",\
  "Телеускорение   ТЗНП4",\
  "Телеускорение   ТЗНП5",\
  "Блокировка ЗОП1",\
  "Блокировка ЗОП2",\
  "2группа уставок ЗОП",\
  "Пуск УРОВ",\
  "BLOCK_UMAX1_DI_OEPRF_ONB",\
  "BLOCK_UMAX2_DI_OEPRF_ONB",\
  "Привод ВВ",\
  "Неисправность цепйй напр ДистЗ",\
  "Работа БО",\
  "Работа БВ",\
  "ПО ДЗ1 МФ",\
  "Cраб ДЗ1 МФ",\
  "ПО МТЗ ДЗ1",\
  "Сраб МТЗ ДЗ1",\
  "ПО ДЗ1 ОФ",\
  "сраб ДЗ1 ОФ",\
  "Cраб ДЗ2 МФ",\
  "ПО ДЗ2 МФ",\
  "Сраб МТЗ ДЗ2",\
  "ПО МТЗ ДЗ2",\
  "Сраб ДЗ2 ОФ",\
  "ПО ДЗ2 ОФ",\
  "Cраб ДЗ3 МФ",\
  "ПО ДЗ3 МФ",\
  "Сраб МТЗ ДЗ3",\
  "ПО МТЗ ДЗ3",\
  "Сраб ДЗ3 ОФ",\
  "ПО ДЗ3 ОФ",\
  "Cраб ДЗ4 МФ",\
  "ПО ДЗ4 МФ",\
  "Сраб МТЗ ДЗ4",\
  "ПО МТЗ ДЗ4",\
  "Сраб ДЗ4 ОФ",\
  "ПО ДЗ4 ОФ",\
  "Cраб ДЗ5 МФ",\
  "ПО ДЗ5 МФ",\
  "Сраб МТЗ ДЗ5",\
  "ПО МТЗ ДЗ5",\
  "Сраб ДЗ5 ОФ",\
  "ПО ДЗ5 ОФ",\
  "Сектор МТЗН1Впер",\
  "Сектор МТЗН1Назад",\
  "Сраб ПО МТЗ1",\
  "Сраб ПО МТЗН1Впер",\
  "Сраб ПО МТЗН1Назад",\
  "Сраб ПО МТЗ1ПН",\
  "Сраб МТЗ1",\
  "Сектор МТЗН2Впер",\
  "Сектор МТЗН2Назад",\
  "Сраб ПО МТЗ2",\
  "Сраб ПО МТЗН2Впер",\
  "Сраб ПО МТЗН2Назад",\
  "Сраб ПО МТЗ2ПН",\
  "Сраб МТЗ2",\
  "Сектор МТЗН3Впер",\
  "Сектор МТЗН3Назад",\
  "Сраб ПО МТЗ3",\
  "Сраб ПО МТЗН3Впер",\
  "Сраб ПО МТЗН3Назад",\
  "Сраб ПО МТЗ3ПН",\
  "Сраб МТЗ3",\
  "Сектор МТЗН4Впер",\
  "Сектор МТЗН4Назад",\
  "Сраб ПО МТЗ4",\
  "Сраб ПО МТЗН4Впер",\
  "Сраб ПО МТЗН4Назад",\
  "Сраб ПО МТЗ4ПН",\
  "Сраб МТЗ4",\
  "Сектор МТЗН5Впер",\
  "Сектор МТЗН5Назад",\
  "Сраб ПО МТЗ5",\
  "Сраб ПО МТЗН5Впер",\
  "Сраб ПО МТЗН5Назад",\
  "Сраб ПО МТЗ5ПН",\
  "Сраб МТЗ5",\
  "Сектор ТЗНП1",\
  "Сраб ПО ТЗНП1",\
  "Сраб ТЗНП1",\
  "ПО ЗНП1(3U0)",\
  "Сраб ЗНП1(3U0)",\
  "ПО ЗНП1(3I0)",\
  "Сраб ЗНП1(3I0)",\
  "Сектор ТЗНП2",\
  "Сраб ПО ТЗНП2",\
  "Сраб ТЗНП2",\
  "ПО ЗНП2(3U0)",\
  "Сраб ЗНП2(3U0)",\
  "ПО ЗНП2(3I0)",\
  "Сраб ЗНП2(3I0)",\
  "Сектор ТЗНП3",\
  "Сраб ПО ТЗНП3",\
  "Сраб ТЗНП3",\
  "ПО ЗНП3(3U0)",\
  "Сраб ЗНП3(3U0)",\
  "ПО ЗНП3(3I0)",\
  "Сраб ЗНП3(3I0)",\
  "Сектор ТЗНП4",\
  "Сраб ПО ТЗНП4",\
  "Сраб ТЗНП4",\
  "ПО ЗНП4(3U0)",\
  "Сраб ЗНП4(3U0)",\
  "ПО ЗНП4(3I0)",\
  "Сраб ЗНП4(3I0)",\
  "Сектор ТЗНП5",\
  "Сраб ПО ТЗНП5",\
  "Сраб ТЗНП5",\
  "ПО ЗНП5(3U0)",\
  "Сраб ЗНП5(3U0)",\
  "ПО ЗНП5(3I0)",\
  "Сраб ЗНП5(3I0)",\
  "Сраб ПО UMAX1",\
  "Сраб UMAX1",\
  "Сраб ПО UMAX2",\
  "Сраб UMAX2",\
  "Сраб ПО Umin1",\
  "Сраб Umin1",\
  "Сраб ПО Umin2",\
  "Сраб Umin2",\
  "Превышене номинального тока откл ВВ",\
  "Ресурс ВВ исчерпан",\
  "Критический ресурс Вв",\
  "Сектор НЗОП1Впер",\
  "Сектор НЗОП1Назад",\
  "ПО ЗОП1",\
  "ПО НЗОП1Впер",\
  "ПО НЗОП1ННазад",\
  "Сраб НЗОП1",\
  "Сектор НЗОП2Впер",\
  "Сектор НЗОП2Назад",\
  "ПО ЗОП2",\
  "ПО НЗОП2Впер",\
  "ПО НЗОП2ННазад",\
  "Сраб НЗОП2",\
  "Сраб УРОВ1",\
  "Сраб УРОВ2",\
  "АПВ1",\
  "АПВ2",\
  "Выход Оф_01",\
  "Выход Оф_02",\
  "Выход Оф_03",\
  "Выход Оф_04",\
  "Выход Оф_05",\
  "Выход Оф_06",\
  "Выход Оф_07",\
  "Выход Оф_08",\
  "Выход Оф_09",\
  "Выход Оф_10",\
  "Выход Оф_11",\
  "Выход Оф_12",\
  "Выход Оф_13",\
  "Выход Оф_14",\
  "Выход Оф_15",\
  "Выход Оф_16",\
  "Выход ОТ1",\
  "Выход ОТ2",\
  "Выход ОТ3",\
  "Выход ОТ4",\
  "Выход ОТ5",\
  "Выход ОТ6",\
  "Выход ОТ7",\
  "Выход ОТ8",\
}

#define NAME_FUNCTION_LIST_ENG {\
  "RESERV_000_OEPRF_ONB",\
  "RESERV_001_OEPRF_ONB",\
  "Вкл. ВВ от ДВ",\
  "Откл. ВВ",\
  "Контроль Вкл",\
  "Контроль Откл",\
  "Сброс Реле",\
  "Сброс индикаци",\
  "Блокировка включения ВВ",\
  "Положение ВВ (выключателя)",\
  "Разблокировка включения ВВ",\
  "Блокировка Дист З1",\
  "Блокировка Дист З2",\
  "Оперативное ускорение Дист З2",\
  "Телеускорение ускорение Дист З2",\
  "Блокировка Опер ускор Дист З2",\
  "Блокировка Дист З3",\
  "Оперативное ускорение Дист З3",\
  "Телеускорение ускорение Дист З3",\
  "Блокировка Опер ускор Дист З3",\
  "Блокировка Дист З4",\
  "Оперативное ускорение Дист З4",\
  "Телеускорение ускорение Дист З4",\
  "Блокировка Опер ускор Дист З4",\
  "Блокировка Дист З5",\
  "Оперативное ускорение Дист З5",\
  "Телеускорение ускорение Дист З5",\
  "Блокировка Опер ускор Дист З5",\
  "2группа уставок ДистЗ",\
  "Блокировка МТЗ1",\
  "Блокировка МТЗ2",\
  "Блокировка МТЗ3",\
  "Блокировка МТЗ4",\
  "Блокировка МТЗ5",\
  "Телеускорение   МТЗ2",\
  "Оперативное ускорение МТЗ2",\
  "Блокировка Опер ускор МТЗ2",\
  "Телеускорение   МТЗ3",\
  "Оперативное ускорение МТЗ3",\
  "Блокировка Опер ускор МТЗ3",\
  "Телеускорение   МТЗ4",\
  "Оперативное ускорение МТЗ4",\
  "Блокировка Опер ускор МТЗ4",\
  "Телеускорение   МТЗ5",\
  "Оперативное ускорение МТЗ5",\
  "Блокировка Опер ускор МТЗ5",\
  "2группа уставок МТЗ",\
  "Пуск АПВ от ДВ",\
  "Блокировка АПВ ОТ ДВ",\
  "Блокировка Umin1",\
  "Пуск Umin1",\
  "Блокировка Umin2",\
  "Пуск Umin2",\
  "Блокировка ТЗНП1",\
  "Оперативное ускорение ТЗНП1",\
  "Блокировка Опер ускор ТЗНП1",\
  "Блокировка ТЗНП2",\
  "Оперативное ускорение ТЗНП2",\
  "Блокировка Опер ускор ТЗНП2",\
  "Блокировка ТЗНП3",\
  "Оперативное ускорение ТЗНП3",\
  "Блокировка Опер ускор ТЗНП3",\
  "Блокировка ТЗНП4",\
  "Оперативное ускорение ТЗНП4",\
  "Блокировка Опер ускор ТЗНП4",\
  "Блокировка ТЗНП5",\
  "Оперативное ускорение ТЗНП5",\
  "Блокировка Опер ускор ТЗНП5",\
  "Телеускорение   ТЗНП1",\
  "Телеускорение   ТЗНП2",\
  "Телеускорение   ТЗНП3",\
  "Телеускорение   ТЗНП4",\
  "Телеускорение   ТЗНП5",\
  "Блокировка ЗОП1",\
  "Блокировка ЗОП2",\
  "2группа уставок ЗОП",\
  "Пуск УРОВ",\
  "BLOCK_UMAX1_DI_OEPRF_ONB",\
  "BLOCK_UMAX2_DI_OEPRF_ONB",\
  "Привод ВВ",\
  "Неисправность цепйй напр ДистЗ",\
  "Работа БО",\
  "Работа БВ",\
  "ПО ДЗ1 МФ",\
  "Cраб ДЗ1 МФ",\
  "ПО МТЗ ДЗ1",\
  "Сраб МТЗ ДЗ1",\
  "ПО ДЗ1 ОФ",\
  "сраб ДЗ1 ОФ",\
  "Cраб ДЗ2 МФ",\
  "ПО ДЗ2 МФ",\
  "Сраб МТЗ ДЗ2",\
  "ПО МТЗ ДЗ2",\
  "Сраб ДЗ2 ОФ",\
  "ПО ДЗ2 ОФ",\
  "Cраб ДЗ3 МФ",\
  "ПО ДЗ3 МФ",\
  "Сраб МТЗ ДЗ3",\
  "ПО МТЗ ДЗ3",\
  "Сраб ДЗ3 ОФ",\
  "ПО ДЗ3 ОФ",\
  "Cраб ДЗ4 МФ",\
  "ПО ДЗ4 МФ",\
  "Сраб МТЗ ДЗ4",\
  "ПО МТЗ ДЗ4",\
  "Сраб ДЗ4 ОФ",\
  "ПО ДЗ4 ОФ",\
  "Cраб ДЗ5 МФ",\
  "ПО ДЗ5 МФ",\
  "Сраб МТЗ ДЗ5",\
  "ПО МТЗ ДЗ5",\
  "Сраб ДЗ5 ОФ",\
  "ПО ДЗ5 ОФ",\
  "Сектор МТЗН1Впер",\
  "Сектор МТЗН1Назад",\
  "Сраб ПО МТЗ1",\
  "Сраб ПО МТЗН1Впер",\
  "Сраб ПО МТЗН1Назад",\
  "Сраб ПО МТЗ1ПН",\
  "Сраб МТЗ1",\
  "Сектор МТЗН2Впер",\
  "Сектор МТЗН2Назад",\
  "Сраб ПО МТЗ2",\
  "Сраб ПО МТЗН2Впер",\
  "Сраб ПО МТЗН2Назад",\
  "Сраб ПО МТЗ2ПН",\
  "Сраб МТЗ2",\
  "Сектор МТЗН3Впер",\
  "Сектор МТЗН3Назад",\
  "Сраб ПО МТЗ3",\
  "Сраб ПО МТЗН3Впер",\
  "Сраб ПО МТЗН3Назад",\
  "Сраб ПО МТЗ3ПН",\
  "Сраб МТЗ3",\
  "Сектор МТЗН4Впер",\
  "Сектор МТЗН4Назад",\
  "Сраб ПО МТЗ4",\
  "Сраб ПО МТЗН4Впер",\
  "Сраб ПО МТЗН4Назад",\
  "Сраб ПО МТЗ4ПН",\
  "Сраб МТЗ4",\
  "Сектор МТЗН5Впер",\
  "Сектор МТЗН5Назад",\
  "Сраб ПО МТЗ5",\
  "Сраб ПО МТЗН5Впер",\
  "Сраб ПО МТЗН5Назад",\
  "Сраб ПО МТЗ5ПН",\
  "Сраб МТЗ5",\
  "Сектор ТЗНП1",\
  "Сраб ПО ТЗНП1",\
  "Сраб ТЗНП1",\
  "ПО ЗНП1(3U0)",\
  "Сраб ЗНП1(3U0)",\
  "ПО ЗНП1(3I0)",\
  "Сраб ЗНП1(3I0)",\
  "Сектор ТЗНП2",\
  "Сраб ПО ТЗНП2",\
  "Сраб ТЗНП2",\
  "ПО ЗНП2(3U0)",\
  "Сраб ЗНП2(3U0)",\
  "ПО ЗНП2(3I0)",\
  "Сраб ЗНП2(3I0)",\
  "Сектор ТЗНП3",\
  "Сраб ПО ТЗНП3",\
  "Сраб ТЗНП3",\
  "ПО ЗНП3(3U0)",\
  "Сраб ЗНП3(3U0)",\
  "ПО ЗНП3(3I0)",\
  "Сраб ЗНП3(3I0)",\
  "Сектор ТЗНП4",\
  "Сраб ПО ТЗНП4",\
  "Сраб ТЗНП4",\
  "ПО ЗНП4(3U0)",\
  "Сраб ЗНП4(3U0)",\
  "ПО ЗНП4(3I0)",\
  "Сраб ЗНП4(3I0)",\
  "Сектор ТЗНП5",\
  "Сраб ПО ТЗНП5",\
  "Сраб ТЗНП5",\
  "ПО ЗНП5(3U0)",\
  "Сраб ЗНП5(3U0)",\
  "ПО ЗНП5(3I0)",\
  "Сраб ЗНП5(3I0)",\
  "Сраб ПО UMAX1",\
  "Сраб UMAX1",\
  "Сраб ПО UMAX2",\
  "Сраб UMAX2",\
  "Сраб ПО Umin1",\
  "Сраб Umin1",\
  "Сраб ПО Umin2",\
  "Сраб Umin2",\
  "Превышене номинального тока откл ВВ",\
  "Ресурс ВВ исчерпан",\
  "Критический ресурс Вв",\
  "Сектор НЗОП1Впер",\
  "Сектор НЗОП1Назад",\
  "ПО ЗОП1",\
  "ПО НЗОП1Впер",\
  "ПО НЗОП1ННазад",\
  "Сраб НЗОП1",\
  "Сектор НЗОП2Впер",\
  "Сектор НЗОП2Назад",\
  "ПО ЗОП2",\
  "ПО НЗОП2Впер",\
  "ПО НЗОП2ННазад",\
  "Сраб НЗОП2",\
  "Сраб УРОВ1",\
  "Сраб УРОВ2",\
  "АПВ1",\
  "АПВ2",\
  "Выход Оф_01",\
  "Выход Оф_02",\
  "Выход Оф_03",\
  "Выход Оф_04",\
  "Выход Оф_05",\
  "Выход Оф_06",\
  "Выход Оф_07",\
  "Выход Оф_08",\
  "Выход Оф_09",\
  "Выход Оф_10",\
  "Выход Оф_11",\
  "Выход Оф_12",\
  "Выход Оф_13",\
  "Выход Оф_14",\
  "Выход Оф_15",\
  "Выход Оф_16",\
  "Выход ОТ1",\
  "Выход ОТ2",\
  "Выход ОТ3",\
  "Выход ОТ4",\
  "Выход ОТ5",\
  "Выход ОТ6",\
  "Выход ОТ7",\
  "Выход ОТ8",\
}

#endif
