/*------------------------------------------------------------------------------
* Created (c) 2014 - Factory “KyivPrylad”
* 
* Permission to use, copy, modify, and distribute this software for any
* purpose with or without fee is hereby granted, provided that the above
* copyright notice and this permission notice appear in all copies.
* 
* THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
* WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
* MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
* ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
* WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
* ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
* OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
* 
*------------------------------------------------------------------------------
*
* Processor       : All
* File Name       : docp.h
* Description     : Definitions and structures for distance protection
                    BM BR BS

*  Version        : 1.00
*
*       +----- (NEW | MODify | ADD | DELete)
*       |
*  No   |   When       Who                What
*-----+---+----------+------------------+--------------------------------------
* 000  NEW  23/04/14   Markovsky A       Creation
*----------------------------------------------------------------------------*/


#ifndef HV_DOCP_h
#define HV_DOCP_h
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr overcurrent protection Manage Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcp1MngStoreDsc_TagIn
{
unsigned char state_mcp1;//меню  Состояние МТЗ1

//.	Состояние
//.	1 -вкл
//.	0 - выкл

unsigned char select_prt_mcp1;//Селектор МТЗ1
//меню  выбор рабоы защиты МТЗ1 Пуск(Работа) 
//по направленности Пуск(Работа) по напряжению

//.	Состояние
//.	0 - Простая
//.	1 - Пуск по направленности
//.	2 - Пуск по напряжению


//unsigned char startU_mcp1;//меню  Состояние Пуска по Напряжению
//.	Состояние
//.	1 -вкл
//.	0 - выкл

//прямой· Adj  direct; straight; through; frank; real
unsigned char DirectionStraight_mcp1;//меню  МТЗ1 Напрвление Вперед Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл


unsigned char DirectionBack_mcp1;//меню  МТЗ1 Напрвление Назад Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл

}DrOcp1MngStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr overcurrent protection PickUP Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcp1PickupStoreDsc_TagIn
{
unsigned int   mcp1_AngleRotation_linear_voltage;
//.	 угол поворота в радианах

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~

unsigned int   mcp1_s1_Ias_ov_range;
//.ПО МТЗН1 прям
//.	 уставка по току
//.	 1 ед = 1 мA



//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~


unsigned int   mcp1_s2_Iabk_ov_range;
//.ПО МТЗН1 обр
//.	 уставка по току
//.	 1 ед = 1 мA


//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp1_IstpU_ov_range;
//.ПО МТЗПН1
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned int   mcp1_Ustp_ov_range;
//.ПО U МТЗПН1
//.	 уставка по пуска по напряжению
//.	 1 ед = 1 мB



//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp1_I_ov_range;
//.ПО МТЗ1
//.	 уставка по току
//.	 1 ед = 1 мA

//.unsigned int   mcp1_g1_Ustp_ov_range;
//.	 уставка по пуска по напряжению
//.	 1 ед = 1 мB



}DrOcp1PickupStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr overcurrent protection StageParam Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcp1StageParamStoreDsc_TagIn
{

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp1_s1_time_stage;
//. Т МТЗН1 вперед
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp1_s2_time_stage;
//.Т МТЗН1 пазад
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе


//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~

unsigned short   mcp1_Ustp_time_stage;
//.T МТЗПН1
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~

unsigned short   mcp1_time_stage;
//.Т мтз1
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе




}DrOcp1StageParamStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr overcurrent protection Manage Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcp2MngStoreDsc_TagIn
{
unsigned char  aclt_mcp_sw;
//.	МТЗ2 Ускорение выключателя
//.	1 -вкл
//.	0 - выкл

unsigned char  state_Auto_aclt_mcp;//Автоматическое ускорение 
//.	1 -вкл
//.	0 - выкл

unsigned char  state_Tele_aclt_mcp;// Разр телеускорения
//.	1 -вкл
//.	0 - выкл

unsigned char state_mcp;//меню  Состояние МТЗ
//.	Состояние
//.	1 -вкл
//.	0 - выкл

unsigned char select_prt_mcp;//Селектор МТЗ
//меню  выбор рабоы защиты МТЗ Пуск(Работа) 
//по направленности Пуск(Работа) по напряжению

//.	Состояние
//.	0 - Простая
//.	1 - Пуск по направленности
//.	2 - Пуск по напряжению

//прямой· Adj  direct; straight; through; frank; real
unsigned char DirectionStraight_mcp;//меню  МТЗ Напрвление Вперед Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл

unsigned char DirectionBack_mcp;//меню  МТЗ  Напрвление Назад Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл


}DrOcp2MngStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr overcurrent protection PickUP Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcp2PickupStoreDsc_TagIn
{
unsigned int   mcp_AngleRotation_linear_voltage;
//.	 угол поворота в радианах

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~

unsigned int   mcp_s1_Ias_ov_range;
//.ПО МТЗН прям
//.	 уставка по току
//.	 1 ед = 1 мA

//--unsigned int   mcp1_s1_Ublk_ov_range;
//.ПО U МТЗН1 прям
//.	 уставка блокировки по напряжению
//.	 1 ед = 1 мB

//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~

unsigned int   mcp_s2_Iabk_ov_range;
//.ПО МТЗН обр
//.	 уставка по току
//.	 1 ед = 1 мA

//--unsigned int   mcp1_s2_Ublk_ov_range;
//.ПО U МТЗН 1 обр
//.	 уставка блокировки по напряжению
//.	 1 ед = 1 мB

//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp_IstpU_ov_range;
//.ПО МТЗПН
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned int   mcp_Ustp_ov_range;
//.ПО U МТЗПН
//.	 уставка по пуска по напряжению
//.	 1 ед = 1 мB



//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp_I_ov_range;
//.ПО МТЗ1
//.	 уставка по току
//.	 1 ед = 1 мA







}DrOcp2PickupStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr overcurrent protection StageParam Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcp2StageParamStoreDsc_TagIn
{
unsigned short   mcp_Tau_AcltImp;          //- длительноть формирования импульса ускорения  ступени МТЗ ---

//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~

unsigned short   mcp_time_stage;
//.Т мтз
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе

unsigned short   mcp_time_stage_Aclt;      //- выдержка ускорения ступени МТЗ                    ---

unsigned short  mcp_T_op_aclt;  //.Т оп.уск.  МТЗ 
//unsigned short  mcp_T_aclt;     //.Т уск.  МТЗ 
//unsigned short  mcp_T_auto_aclt;//.Т авт.уск. МТЗ
unsigned short  mcp_T_tele_aclt;//.Т телеуск.   МТЗ 

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp_s1_time_stage;
//. Т МТЗН вперед
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе
unsigned short  mcp_s1_T_op_aclt;  //.Т оп.уск.  МТЗ 
unsigned short  mcp_s1_T_aclt;     //.Т уск.  МТЗ 

unsigned short  mcp_s1_T_tele_aclt;//.Т телеуск.   МТЗ 


//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp_s2_time_stage;
//.Т МТЗН пазад
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе
unsigned short  mcp_s2_T_op_aclt;  //.Т оп.уск.  МТЗ 
unsigned short  mcp_s2_T_aclt;     //.Т уск.  МТЗ 

unsigned short  mcp_s2_T_tele_aclt;//.Т телеуск.   МТЗ 



//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~

unsigned short   mcp_Ustp_time_stage;
//.T МТЗПН
//.	выдержка X- ступени МТЗ
//.	1 ед =10мсе
unsigned short  mcp_Ustp_T_op_aclt;  //.Т оп.уск.  МТЗ 
unsigned short  mcp_Ustp_T_aclt;     //.Т уск.  МТЗ 

unsigned short  mcp_Ustp_T_tele_aclt;//.Т телеуск.   МТЗ 



/*
unsigned short   mcp_time_stage_Aclt;      //- выдержка ускорения ступени МТЗ                    ---
unsigned short   mcp_s1_time_stage_Aclt;   //- выдержка ускорения ступени МТЗН вперед           ---
unsigned short   mcp_s2_time_stage_Aclt;   //- выдержка ускорения ступени МТЗН назад            ---
unsigned short   mcp_Ustp_time_stage_Aclt; //- выдержка ускорения ступени с пуском по напряжению ---
unsigned short   mcp_Tau_AcltImp;          //- длительноть формирования импульса ускорения  ступени МТЗ ---

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp_s1_time_stage;
//. Т МТЗН вперед
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp_s2_time_stage;
//.Т МТЗН пазад
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~

unsigned short   mcp_Ustp_time_stage;
//.T МТЗПН
//.	выдержка X- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~


unsigned short   mcp_time_stage;
//.Т мтз
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе
*/



}DrOcp2StageParamStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""






#endif 

