/*------------------------------------------------------------------------------
* Created (c) 2014 - Factory “KyivPrylad”
* 
* Permission to use, copy, modify, and distribute this software for any
* purpose with or without fee is hereby granted, provided that the above
* copyright notice and this permission notice appear in all copies.
* 
* THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
* WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
* MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
* ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
* WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
* ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
* OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
* 
*------------------------------------------------------------------------------
*
* Processor       : All
* File Name       : hve_df.h
* Description     : Definitions and structures for HVP projct
                    BM BR BS

*  Version        : 1.00
*
*       +----- (NEW | MODify | ADD | DELete)
*       |
*  No   |   When       Who                What
*-----+---+----------+------------------+--------------------------------------
* 000  NEW  23/04/14   Markovsky A       Creation
*----------------------------------------------------------------------------*/


#ifndef HVE_DF_h
#define HVE_DF_h

//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  distance protection    Перечень констант ДЗ          ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~  Fault U Distance Protection  ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DstpFalutDsc_TagIn
{
unsigned short   dstp_time_T_UI_Ncn;
unsigned short   dstp_time_T_Nsmp_Ncn;//Обратная последовательность Negative sequence protection
}DstpFltDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Line distance protection Stage  ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DstpDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}DstpDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Line distance protection  Stngs ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct Dstp1PickupStoreDsc_TagIn
{
unsigned char state_dstp1;//меню  Состояние ДЗ
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char state_blk_from drift_dstp1;//Блокировка ДЗ1 от качаний
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char state_ocp_dstp1;// МТЗ ДЗ1
//.	Состояние
//.	1 -вкл
//.	0 - выкл

long Z_OF_Dstp1_P1_R;//Active
long Z_OF_Dstp1_P1_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_OF_Dstp1_P2_R;//Active
long Z_OF_Dstp1_P2_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_OF_Dstp1_P3_R;//Active
long Z_OF_Dstp1_P3_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_OF_Dstp1_P4_R;//Active
long Z_OF_Dstp1_P4_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp1_P1_R;//Active
long Z_MF_Dstp1_P1_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp1_P2_R;//Active
long Z_MF_Dstp1_P2_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp1_P3_R;//Active
long Z_MF_Dstp1_P3_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp1_P4_R;//Active
long Z_MF_Dstp1_P4_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм
unsigned long   Dstp1_Iovp_ov_range;
//.ПО I МТЗ ДЗ1
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned short  Dstp1_T_OF ;//
//.Длительность Т ДЗ1 OФ 
//.1 ед =10мсе


unsigned short  Dstp1_T_MF ;//
//.Длительность Т ДЗ1 МФ 
//.1 ед =10мсе
unsigned short  Dstp1_T_Ocp ;//
//.Длительность Т МТЗ ДЗ1  
//.1 ед =10мсе

}Dstp1PickupStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""


typedef struct DstpPickupStoreDsc_TagIn
{
unsigned char state_dstp2;//меню  Состояние ДЗ
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char state_blk_from drift_dstp2;//Блокировка ДЗ2 от качаний
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char state_ocp_dstp2;// МТЗ ДЗ2
//.	Состояние
//.	1 -вкл
//.	0 - выкл


unsigned char state_Auto_aclt_dstp2;// Автоматическое ускорение ДЗ2
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char  state_aclt_dstp2_hws;
//.	ДЗ2 Ускорение ДЗ2 при включении ВВ
//.	1 -вкл
//.	0 - выкл
unsigned char state_Tele_aclt_dstp2;// Телеускорение ДЗ2
//.	Состояние
//.	1 -вкл
//.	0 - выкл
//.ПО  ДЗ2 OФ
long Z_OF_Dstp2_P1_R;//Active
long Z_OF_Dstp2_P1_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_OF_Dstp2_P2_R;//Active
long Z_OF_Dstp2_P2_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_OF_Dstp2_P3_R;//Active
long Z_OF_Dstp2_P3_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_OF_Dstp2_P4_R;//Active
long Z_OF_Dstp2_P4_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм
//.ПО  ДЗ2 МФ
long Z_MF_Dstp2_P1_R;//Active
long Z_MF_Dstp2_P1_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp2_P2_R;//Active
long Z_MF_Dstp2_P2_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp2_P3_R;//Active
long Z_MF_Dstp2_P3_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм

long Z_MF_Dstp2_P4_R;//Active
long Z_MF_Dstp2_P4_X;//Reactive
//. уставка по сопротивлению
//. 1 ед = 1 Oм
unsigned long   Dstp2_Iovp_ov_range;
//.ПО I МТЗ ДЗ2 
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned short  Dstp2_OF_T_op_aclt;  //.Т оп.уск. ДЗ2 ОФ
unsigned short  Dstp2_OF_T_auto_aclt;//.Т авт.уск. ДЗ2 ОФ
unsigned short  Dstp2_OF_T_aclt;     //.Т уск. ДЗ2 ОФ
unsigned short  Dstp2_OF_T_tele_aclt;//.Т телеуск.  ДЗ2 ОФ
unsigned short  Dstp2_OF_T;          //.Т  ДЗ2 ОФ
//.ПО  ДЗ2 ОФ

unsigned short  Dstp2_MF_T_op_aclt;  //.Т оп.уск ДЗ2 МФ
unsigned short  Dstp2_MF_T_auto_aclt;//.Т авт.уск. ДЗ2 МФ
unsigned short  Dstp2_MF_T_aclt;     //.Т уск. ДЗ2 МФ при вкл ВВ
unsigned short  Dstp2_MF_T_tele_aclt;//.Т телеуск.  ДЗ2 МФ
unsigned short  Dstp2_MF_T;          //.Т  ДЗ2 МФ

unsigned short  Dstp2_Ocp_T_op_aclt;  //.Т оп.уск МТЗ ДЗ2 
unsigned short  Dstp2_Ocp_T_auto_aclt;//.Т авт.уск. МТЗ ДЗ2 
unsigned short  Dstp2_Ocp_T_aclt;     //.Т уск.МТЗ ДЗ2  при вкл ВВ
unsigned short  Dstp2_Ocp_T_tele_aclt;//.Т телеуск. МТЗ ДЗ2 
unsigned short  Dstp2_Ocp_T;          //.Т МТЗ ДЗ2 

unsigned short  Dstp2_HWS_Tau_Aclt;    //.T ввода уск. ДЗ2 при вкл ВВ
unsigned short  Dstp2_Ocp_HWS_Tau_Aclt;//.T ввода уск.МТЗ ДЗ2 при вкл. ВВ

//.
//


}Dstp2PickupStoreDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""



//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//ANSI 67 – DIRECTIONAL PHASE OVERCURRENT
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of   Перечень констант  MТЗН                  ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   мтзн   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcpDsc_TagIn
{
////////////////////////////////////////////////////////////////////////
//параметры МТЗ1
////////////////////////////////////////////////////////////////////////
unsigned char state_mcp1;//меню  Состояние МТЗ1

//.	Состояние
//.	1 -вкл
//.	0 - выкл

unsigned char select_prt_mcp1;//Селектор МТЗ1
//меню  выбор рабоы защиты МТЗ1 Пуск(Работа) 
//по направленности Пуск(Работа) по напряжению

//.	Состояние
//.	0 - Простая
//.	1 - Пуск по направленности
//.	2 - Пуск по напряжению


//unsigned char startU_mcp1;//меню  Состояние Пуска по Напряжению
//.	Состояние
//.	1 -вкл
//.	0 - выкл

//прямой· Adj  direct; straight; through; frank; real
unsigned char DirectionStraight_mcp1;//меню  МТЗ1 Напрвление Вперед Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл


unsigned char DirectionBack_mcp1;//меню  МТЗ1 Напрвление Назад Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned int   mcp1_AngleRotation_linear_voltage;
//.	 угол поворота в радианах

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp1_s1_time_stage;
//. Т МТЗН1 вперед
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе
unsigned int   mcp1_s1_Ias_ov_range;
//.ПО МТЗН1 прям
//.	 уставка по току
//.	 1 ед = 1 мA

//--unsigned int   mcp1_s1_Ublk_ov_range;
//.ПО U МТЗН1 прям
//.	 уставка блокировки по напряжению
//.	 1 ед = 1 мB

//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp1_s2_time_stage;
//.Т МТЗН1 пазад
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе

unsigned int   mcp1_s2_Iabk_ov_range;
//.ПО МТЗН1 обр
//.	 уставка по току
//.	 1 ед = 1 мA

//--unsigned int   mcp1_s2_Ublk_ov_range;
//.ПО U МТЗН 1 обр
//.	 уставка блокировки по напряжению
//.	 1 ед = 1 мB

//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp1_IstpU_ov_range;
//.ПО МТЗПН1
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned int   mcp1_Ustp_ov_range;
//.ПО U МТЗПН1
//.	 уставка по пуска по напряжению
//.	 1 ед = 1 мB

unsigned short   mcp1_Ustp_time_stage;
//.T МТЗПН1
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp1_I_ov_range;
//.ПО МТЗ1
//.	 уставка по току
//.	 1 ед = 1 мA

//.unsigned int   mcp1_g1_Ustp_ov_range;
//.	 уставка по пуска по напряжению
//.	 1 ед = 1 мB

unsigned short   mcp1_time_stage;
//.Т мтз1
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе


}DrOcp1Dsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//ANSI 67 – DIRECTIONAL PHASE OVERCURRENT
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of   Перечень констант  MТЗН                  ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   мтзн   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrOcpDsc_TagIn
{
////////////////////////////////////////////////////////////////////////
//параметры МТЗ
////////////////////////////////////////////////////////////////////////
unsigned char  aclt_mcp_sw;
//.	МТЗ2 Ускорение выключателя
//.	1 -вкл
//.	0 - выкл

unsigned char  state_aclt_mcp;//Состояние ключя МТЗ ускоренная
//.	1 -вкл
//.	0 - выкл

unsigned char state_mcp;//меню  Состояние МТЗ
//.	Состояние
//.	1 -вкл
//.	0 - выкл

unsigned char select_prt_mcp;//Селектор МТЗ
//меню  выбор рабоы защиты МТЗ Пуск(Работа) 
//по направленности Пуск(Работа) по напряжению

//.	Состояние
//.	0 - Простая
//.	1 - Пуск по направленности
//.	2 - Пуск по напряжению

//прямой· Adj  direct; straight; through; frank; real
unsigned char DirectionStraight_mcp;//меню  МТЗ Напрвление Вперед Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл

unsigned char DirectionBack_mcp;//меню  МТЗ  Напрвление Назад Состояние 

//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned int   mcp_AngleRotation_linear_voltage;
//.	 угол поворота в радианах
unsigned short   mcp_time_stage_Aclt;      //- выдержка ускорения ступени МТЗ                    ---
unsigned short   mcp_s1_time_stage_Aclt;   //- выдержка ускорения ступени МТЗН вперед           ---
unsigned short   mcp_s2_time_stage_Aclt;   //- выдержка ускорения ступени МТЗН назад            ---
unsigned short   mcp_Ustp_time_stage_Aclt; //- выдержка ускорения ступени с пуском по напряжению ---
unsigned short   mcp_Tau_AcltImp;          //- длительноть формирования импульса ускорения  ступени МТЗ ---

//~~~~~~~~~~~~~~~~~~~~          Angle Staight    ~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp_s1_time_stage;
//. Т МТЗН1 вперед
//.	выдержка x- ступени МТЗ
//.	1 ед =10мсе
unsigned int   mcp_s1_Ias_ov_range;
//.ПО МТЗН прям
//.	 уставка по току
//.	 1 ед = 1 мA

//--unsigned int   mcp1_s1_Ublk_ov_range;
//.ПО U МТЗН1 прям
//.	 уставка блокировки по напряжению
//.	 1 ед = 1 мB

//~~~~~~~~~~~~~~~~~~~~        Angle Back        ~~~~~~~~~~~~~~~~~~~~~~~
unsigned short   mcp_s2_time_stage;
//.Т МТЗН пазад
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе

unsigned int   mcp_s2_Iabk_ov_range;
//.ПО МТЗН обр
//.	 уставка по току
//.	 1 ед = 1 мA

//--unsigned int   mcp1_s2_Ublk_ov_range;
//.ПО U МТЗН 1 обр
//.	 уставка блокировки по напряжению
//.	 1 ед = 1 мB

//~~~~~~~~~~~~~~~~~~~~        Start Voltage        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp_IstpU_ov_range;
//.ПО МТЗПН
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned int   mcp_Ustp_ov_range;
//.ПО U МТЗПН
//.	 уставка по пуска по напряжению
//.	 1 ед = 1 мB

unsigned short   mcp_Ustp_time_stage;
//.T МТЗПН
//.	выдержка X- ступени МТЗ
//.	1 ед =10мсе

//~~~~~~~~~~~~~~~~~~~~        Boring MCP        ~~~~~~~~~~~~~~~~~~~~
unsigned int   mcp_I_ov_range;
//.ПО МТЗ1
//.	 уставка по току
//.	 1 ед = 1 мA

unsigned short   mcp_time_stage;
//.Т мтз1
//.	выдержка 1- ступени МТЗ
//.	1 ед =10мсе


}DrOcp2Dsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//ANSI 67N/67NC – DIRECTIONAL EARTH FAULT
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       Перечень констант  ТЗНП                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Dr Earth fault protection ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct DrErthPrtDsc_TagIn
{
unsigned char  state_Tznp;
//.   Состояние
//.   1 -вкл
//.   0 - выкл
unsigned char  direction_Tznp1;
//.Состояние
//.1 -вперёд
//.0 - назад
unsigned char  state_Tznp_3U0;
//.   Состояние
//.   1 -вкл
//.   0 - выкл
unsigned char  state_Tznp_3I0;
//.   Состояние
//.   1 -вкл
//.   0 - выкл
unsigned char  state_aclt_Tznp;//Состояние ключя ТЗH ускоренная
//.	1 -вкл
//.	0 - выкл
unsigned char  state_over_wk_aclt_Tznp;//Оперативное ускорение ТЗНП
//.	1 -вкл
//.	0 - выкл
unsigned char   aclt_Tznp_sw;//ускорение ТЗНП
//.	1 -вкл
//.	0 - выкл

//~~~~~~~~~~~~~~~~~~~~        Angle Tznp    ~~~~~~~~~~~~~~~~~~~~~
unsigned int   AngleRotation_3I0_Tznp;
//. угол поворота 3I0_1 в градусах
//~~~~~~~~~~~~~~~~~~~~          Angle Tznp    ~~~~~~~~~~~~~~~~~~~~~
unsigned int   time_Tznp;
//.выдержка Tznp1
//.1 ед =10мсе
unsigned short Tznp_time_stage_Aclt;   //- выдержка ускорения ступени ТЗНП   
unsigned short Tznp_time_stage_3U0;    //- выдержка T 3U0 ЗНП1 
unsigned short Tznp_time_stage_3I0;    //- выдержка T 3I0 ЗНП1 
unsigned short Tznp3I0_time_stage_Aclt;//T ускор ЗНП1 3I0
unsigned short Tznp_Tau_AcltImp;       //- длительность формирования импульса ускорения  ступени ТЗНП   

unsigned int   ov_range_3Io_Tznp;
//. уставка по 3Io
//. 1 ед = 1 мA
unsigned int   ov_range_3Uo_Tznp;
//. уставка по 3Uo
//. 1 ед = 10 мВ


}DrErthPrtDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       Перечень констант  3U0                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   U3U0Prt   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct U3UoPrtDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}U3UoPrtDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//ZOP ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  ZOP                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   ZOP   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct NspDsc_TagIn
{

unsigned char select_prt_zop;//Селектор зоп
//меню  выбор рабоы защиты ЗОП Пуск(Работа) 
//по направленности Пуск(Работа) по напряжению
//.	Состояние
//.	0 - Простая
//.	1 - Пуск по направленности

unsigned char state_dir_zop;
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char select_dir_zop;
//.	Состояние
//.	1 - прямая
//.	0 - обратная
unsigned int ov_range_Zop;
//. уставка по току ПО ЗОП1
//. 1 ед = 1 мA

unsigned int ov_range_Zop_s_I2;
//. уставка по току ПО НЗОП прям
//. 1 ед = 1 мA
unsigned int ov_range_Zop_s_U2;
//. уставка по напряжению ПО НЗОП  прям
//. 1 ед = 1 мA

unsigned int ov_range_Zop_b_I2;
//. уставка по току ПО НЗОП обр
//. 1 ед = 1 мA
unsigned int ov_range_Zop_b_U2;
//. уставка по напряжению ПО НЗОП  обр
//. 1 ед = 1 мB
//unsigned int   time_Tzop;
//.выдержка Tznp1
//.1 ед =10мсе
unsigned short time_stage_Zop;   //- выдержка ЗОП
unsigned short time_stage_Zop_s;    //- выдержка T вперед ЗOП 
unsigned short time_stage_Zop_b;    //- выдержка T назад ЗOП 



}NspDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//Umin ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  Umin                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Umin   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct UminDsc_TagIn
{
////////////////////////////////////////////////////////////////////////
///Umin
////////////////////////////////////////////////////////////////////////

unsigned char state_Umin;       //Меню Состояние Umin
unsigned char state_SDEV_Umin;  //Меню Состояние ПО Umin И\ИЛИ 
unsigned char state_Umin_Ublk;  //Состояние ПО блокировки по напряжению
unsigned char state_Umin_Iblk;  //Состояние ПО блокировки по току
unsigned char state_SDEV_Phase; //Меню Состояние ПО фазные/линейные 
//.Состояние
//.1 -вкл
//.0 - выкл

unsigned short	 time_stage_Umin1;
//.	выдержка 1- ступени Umin
//.	1 ед =10мсе


//. уставки по Напряжению
//. 1 ед = 1 мB

unsigned int ov_range_Umin1;

//unsigned int ov_range_Umin_blk;

//. уставки по Напряжению
//. 1 ед = 1 мB


//. уставка по току
//. 1 ед = 1 мA

unsigned int ov_range_IblkUmin1;

}UminDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//Umax ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  Umax                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Umax   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct UmaxDsc_TagIn
{
////////////////////////////////////////////////////////////////////////
//-Umax
unsigned char state_Umax1;     //Меню Состояние Umax1
unsigned char state_SDEV_Umax1;//Меню Состояние ПО Umax1 И\ИЛИ 
unsigned char state_SDEV_Phase;//Меню Состояние ПО фазные/линейные 
//.Состояние
//.1 -вкл
//.0 - выкл

unsigned short	 time_stage_Umax1;

//.выдержка 1- ступени Umax1
//.1 ед =10мсе

//. уставки по Напряжению
//. 1 ед = 1 мB

unsigned int ov_range_Umax1;

////////////////////////////////////////////////////////////////////////
}UmaxDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//AC-Reclosing Relay ANSI - 79
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  Rclr                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
#define  AMOUNT_BYTE_FOR_RCLR_STP   (((RESERV_MAX_STP_RCLR_ONB)>>3) +1) 
//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~  ARR    ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct RclrDsc_TagIn
{

////////////////////////////////////////////////////////////////////////
///АПВ`
////////////////////////////////////////////////////////////////////////
unsigned char  state_Rclr;//АПВ
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char  state_Rclr2;//АПВ2
//.	Состояние
//.	1 -вкл
//.	0 - выкл
//Массив битовых переключателей команд пуска АПВ 
//Значения бит см enum ENMEpr_StpRclr epr_f.h
unsigned char ar_Rclr_Stp_Cmd_state[AMOUNT_BYTE_FOR_RCLR_STP]; 
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned char select_Mode_Rclr;//Селектор АПВ
//меню  выбор рабоы АПВ Пуск(Работа) 
//
//.	Состояние
//.	0 - Без контроля
//.	1 - Контроль отсутствия напряжения на линии и наличия напряжения на шинах
//.	2 - Контроль наличия напряжения на линии и отсутствия напряжения на шинах
//.	3 - Контроль наличия напряжения на линии и наличия напряжения на шинах
//       и без синхронизма..
//.	4 - Контроль наличия напряжения на линии и наличия напряжения на шинах
//     и синхронизма..

unsigned int   Rclr_U_ov_range1;
//.ПО АПВ 1
//.	 уставка по по напряжению
//.	 1 ед = 1 мB
unsigned int   Rclr_U_ov_range2;
//.ПО АПВ 2
//.	 уставка по по напряжению
//.	 1 ед = 1 мB
unsigned int   Rclr_U_ov_range3;
//.ПО АПВ 3
//.	 уставка по по напряжению
//.	 1 ед = 1 мB
unsigned int   Rclr_U_ov_range4;
//.ПО АПВ 4
//.	 уставка по по напряжению
//.	 1 ед = 1 мB

unsigned short  Rclr1_T_wait_U ;
//.Длительность ож U АПВ1 
//.1 ед =10мсе
unsigned short  Rclr1_T_wait_sycro ;
//.Длительность ож синхронизма АПВ1 
//.1 ед =10мсе
unsigned short  Rclr1_T_blk;
//.Длительность блокировки  АПВ1 
//.1 ед =10мсе

unsigned short  Rclr1_T;
//.Длительность   АПВ1 
//.1 ед =10мсе

unsigned short  Rclr_T_forbid;
//.Длительность запрета  АПВ1 
//.1 ед =10мсе

unsigned short  Rclr_T_blk_HSW;
//.Длительность блокировки  АПВ от ВВ 
//.1 ед =10мсе

unsigned short  Rclr2_T_wait_U ;
//.Длительность ож U АПВ2 
//.1 ед =10мсе
unsigned short  Rclr2_T_wait_syncro ;
//.Длительность ож синхронизма АПВ2 
//.1 ед =10мсе
unsigned short  Rclr2_T_blk;
//.Длительность блокировки  АПВ2 
//.1 ед =10мсе



}RclrDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//Urov ANSI - ANSI 50BF – BREAKER FAILURE
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  Brf                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
#define  AMOUNT_BYTE_FOR_BRF_STP   (((RESERV_MAX_STP_BRF_ONB)>>3) +1) 
//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Brf   ~~~UROV
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct BrfDsc_TagIn
{
////////////////////////////////////////////////////////////////////////
///УРОВ
////////////////////////////////////////////////////////////////////////
unsigned char state_Urov;//Состояние УРОВ
//Массив битовых переключателей команд пуска УРОВ 
//Значения бит см enum ENMEpr_StpBrf epr_f.h
unsigned char ar_Brf_Stp_Cmd_state[AMOUNT_BYTE_FOR_BRF_STP]; 
//.	Состояние
//.	1 -вкл
//.	0 - выкл
unsigned short	 time_stage_Urov1;//Выдержка 1 Ступени УРОВ
unsigned short	 time_stage_Urov2;//Выдержка 2 Ступени УРОВ

//.	выдержка 1- ступени 
//.	1 ед =10мсе
unsigned int ov_range_Urov;
//. уставка по току
//. 1 ед = 1 мA



}BrfDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//Breaker Unit Bru ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  Bru                       ~~~~~BV
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Bru   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct BruDsc_TagIn
{

unsigned short time_stageOFFUnit;  //выдержка формирователя Блока отключения
unsigned short time_stageONUnit;   //выдержка формирователя Блока включения
unsigned short time_stageONCtrl;   //выдержка формирователя блокировки Блока включения
unsigned short time_stageONUnitBlk;//выдержка формирователя удлинения блокировки Блока включения

//////////////////////////////////////////////////////////////////////////////////////////
unsigned char state_Delay_ON_Unit;//Задержка вкл.
unsigned char state_Blk_SetON;    //Блокировка вкл ВВ общ   

}BruDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""



//Определение места повреждения (FL)fault  Location 
//FL ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  FL                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   FL   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct FLDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}FLDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//Расчет ресурса высоковольтного выключателя CalсHvpBrOn
// ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  CalсHvpBrOn                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   Umax   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct CalсHvpBrOnDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}CalсHvpBrOnDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//Технический учет электроэнергии Сalc power consumption
//CalcPwr ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  CalcPwr                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~  CalcPwr   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct CalcPwrDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}CalcPwrDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""


//OFunc ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  OFunc                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   OFunc   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct OFuncDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}OFuncDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""


//OTrg ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  OTrg                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   OTrg   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct OTrgDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}OTrgDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//OLgc ANSI -
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//~~~       List of  OLgc                       ~~~~~
//,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""

//#define      1 
//#define      2
//#define      3
//#define      4
//``````````````````````````````````````````````````````````````````````````````````
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
//``````````````````````````````````````````````````````````````````````````````````
//                   ~~~   OTrg   ~~~
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
typedef struct OLgcDsc_TagIn
{
long sizeAr;      //Размер считанного массива
long *pTenPerData;//Указатель на начало данных

}OLgcDsc;
//~~~   
//..................................................................................
//""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""







#endif 